/****************************************Copyright (c)****************************************************
**                               
**                                     
**                                 
**
**--------------File Info---------------------------------------------------------------------------------
** File Name:           ZLG7289.h
** Last modified Date:  2014/5/10
** Last Version:        V1.00
** Description:         数码管显示与键盘管理芯片ZLG7289 针对STM32的驱动程序头文件
** 
**--------------------------------------------------------------------------------------------------------
** Created By:          陈杰鸿
** Created date: 
** Version: 
** Descriptions: 
**
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Description:
**
*********************************************************************************************************/
#ifndef _ZLG7289_H_
#define _ZLG7289_H_
#include "stm32f10x.h"
#include "Type.h"
#include "BitBand.h"
/*********************************************************************************************************
  ZLG7289端口定义
*********************************************************************************************************/       
      
#define       ZLG7289_CS     PBout(4)// PD10
#define       ZLG7289_CLK    PBout(6)// PD11    
#define       ZLG7289_DIO    PBout(5)// PD12    
#define       ZLG7289_KEY    PBout(3)// PD13

/*********************************************************************************************************
  可以供外部使用的函数申明
*********************************************************************************************************/
extern void zlg7289Cmd(char  cCmd);                                     /*  执行ZLG7289 纯指令          */
extern void zlg7289CmdDat(u8  cCmd, char  cDat);                     /*  执行ZLG7289 带数据指令      */
extern void zlg7289Download(u8 ucMod, char cX, char cDp, char cDat); /*  下载数据                    */
extern char zlg7289Key(void);                                           /*  读按键值                    */
extern void ZLG7289Init(void);                                          /*  ZLG7289 初始化              */
extern void ZLG7289_KEY_Init(void);
/*********************************************************************************************************
  ZLG7289用户指令集
*********************************************************************************************************/
#define zlg7289Reset()      zlg7289Cmd(0xA4)                            /*  复位(清除)指令              */
#define zlg7289Test()       zlg7289Cmd(0xBF)                            /*  测试指令                    */
#define zlg7289SHL()        zlg7289Cmd(0xA0)                            /*  左移指令                    */
#define zlg7289SHR()        zlg7289Cmd(0xA1)                            /*  右移指令                    */
#define zlg7289ROL()        zlg7289Cmd(0xA2)                            /*  循环左移指令                */
#define zlg7289ROR()        zlg7289Cmd(0xA3)                            /*  循环右移指令                */

#define zlg7289Flash(cX)    zlg7289CmdDat(0x88, (cX))                   /*  闪烁控制                    */
                                                                        /*  cX的8个位对应数码管的8个位  */
                                                                        /*  0:闪烁  1:不闪烁            */

#define zlg7289Hide(cX)     zlg7289CmdDat(0x98, (cX))                   /*  消隐控制                    */
                                                                        /*  cX的8个位对应数码管的8个位  */
                                                                        /*  0:消隐  1:显示              */

#define zlg7289SegOn(cSeg)  zlg7289CmdDat(0xE0, (cSeg))                 /*  段点亮指令                  */
                                                                        /*  8个数码管被看成64个独立LED  */
                                                                        /*  cSeg: 0 ～ 63               */

#define zlg7289SegOff(cSeg) zlg7289CmdDat(0xC0, (cSeg))                 /*  段关闭指令                  */
                                                                        /*  8个数码管被看成64个独立LED  */
                                                                        /*  cSeg: 0 ～ 63               */

#endif
/*********************************************************************************************************
  END FILE
*********************************************************************************************************/
